Catalogs/Оборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Оборудование</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчаствуетВКалендарномПланировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируетсяБезСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МоделиОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСпособЗаполненияГрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыЗаполненияГрафиковРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьAETitle</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AETitles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ПлощадьПомещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорияПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>омг_Специализации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>омг_Оборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.омг_МоделиОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Оборудование/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Объект.ОсновнойСпособЗаполненияГрафика.Пустая() Тогда
		НаследоватьСпособЗаполненияГрафикаОтПодразделения = Истина;
		Элементы.ОсновнойСпособЗаполненияГрафика.Доступность = Ложь;
	Иначе
		НаследоватьСпособЗаполненияГрафикаОтПодразделения = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НаследоватьСпособЗаполненияГрафикаОтПодразделения Тогда
		ТекущийОбъект.ОсновнойСпособЗаполненияГрафика = Справочники.СпособыЗаполненияГрафиковРабот.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаследоватьОтГруппыПриИзменении(Элемент)
	Элементы.ОсновнойСпособЗаполненияГрафика.Доступность = Не НаследоватьСпособЗаполненияГрафикаОтПодразделения;
КонецПроцедуры
	
#КонецОбласти    

///////////////////////////////////////////////////////////////////
// ОМГ +

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НовыйЭлемент = Элементы.Добавить("омг_Организация", Тип("ПолеФормы"),ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.омг_Организация";
	Элементы.Переместить(НовыйЭлемент,ЭтаФорма,Элементы.ГруппаПодвал); 
	
	НовыйЭлемент = Элементы.Добавить("омг_Филиал", Тип("ПолеФормы"),ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.омг_Филиал";
	Элементы.Переместить(НовыйЭлемент,ЭтаФорма,Элементы.ГруппаПодвал);

	НовыйЭлемент = Элементы.Добавить("омг_ПлощадьПомещения", Тип("ПолеФормы"),ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.омг_ПлощадьПомещения";
	Элементы.Переместить(НовыйЭлемент,ЭтаФорма,Элементы.ГруппаПодвал);  
	
	//ТаблицаФормы = Элементы.Добавить("омг_Специализации", Тип("ТаблицаФормы"),ЭтаФорма);
	//ТаблицаФормы.ПутьКДанным = "Объект.омг_Специализации";	
	//НовыйЭлемент  = Элементы.Добавить("омг_СпециализацииСпециализация",Тип("ПолеФормы"),ТаблицаФормы);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	//НовыйЭлемент.ПутьКДанным = "Объект.омг_Специализации.Специализация";

КонецПроцедуры
// ОМГ -
///////////////////////////////////////////////////////////////////
